Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 把所有药草准备好，江逸擦了擦额头上的汗水，站起身朝外走去，却看到一个披头散发的老头正站在他身后盯着他看，这种感觉就像酣睡中发现厉鬼在侧般恐怖……
en_us: After preparing all the medicinal herbs, Jiang Yi wiped off the sweat on his forehead, stood up and walked outside. However, he saw an old man with disheveled hair standing behind him and staring at him. The horrible feeling he got was akin to discovering a scary ghost on one's side while one was in deep slumber...

source: 抑着脖子看着眼前突然出现，山般高大的巨大怪兽……
en_us: Suddenly, a beast as tall as a mountain appeared in front of her very eyes. She tilted her neck upwards to get a clearer view of the beast.

source: 抓……抓住了？！
en_us: "Caught...caught?"

source: 抓着袋子的沈萤：“……”MMP！
en_us: Holding on to her bags, Shen Ying: "..." What the hell!"

source: 抢我的饭碗还有理了！
en_us: Snatched my bowl and you are still trying to talk reason!

source: 报信的少女，江逸认识，是住旁边的一名江家老奴的女儿，平时和小奴走得近，也经常一起偷偷出去做工。
en_us: Jiang Yi recognized the young girl bearing the news, it was the daughter of an elderly Jiang Clan chambermaid staying next door. She and Xiaonu were good friends and sometimes would sneak out together for work.

source: 抬头一看，只见一座山一样高的巨大怪兽，不知道什么时候蹦了出来，两只车灯样大的眼睛，正死死盯着她前面坑里的——萝卜精？
en_us: Shen Ying lifted her head and her field of vision was covered by a beast, which stood as tall as a mountain. She didn't know when or how it appeared. The beast had eyes that looked just like headlights, its gaze transfixed on the radish spirit in the pit.

source: 抬头看向上首，笑了一声。
en_us: She raised her head and looked up with a laugh.

source: 拜贴？
en_us: Visiting card?

source: 拼命的挤出了几个字，“柿（是）炸鲜（大仙）。”不是不想回，是真的肿得说不了话啊，嘶……好痛啊！
en_us: With all the willpower he had, he stuttered, "Y-Yeth, Gray Immorer." It wasn't that he didn't want to answer her — he really couldn't speak. He was still in so much pain!

source: 挂件瞬间开心的伸出两片大叶子，做了个抱抱的动作，乖巧朝对方扑了过去。还没碰到衣服，沈萤却突然转过了头，秒拒！
en_us: The pendant happily extended two large leaves in a hugging motion, and rushed over to Shen Ying. But it had not even managed to touch her clothes when Shen Ying suddenly turned her head away in rejection!

source: 按说十二阶的毒兽早就可以化形，不会轻易以原形现身，除非它有什么目的。
en_us: Based on his experience, twelfth-level beasts were experts at manifestation. They would never reveal their true form unless they had a motive.

source: 挖的还是同一个，上次只到腰深，这会已经齐颈了。
en_us: It was the same pit, only now, instead of being waist deep, it had now reached neck height.

source: 振祥一愣，仿佛这才发现人群中，还有其它人，自己的法器居然这么轻易的就被对方控制了。
en_us: Zhen Xiang was stunned and as if just realizing there was someone else in the group. His Dharma artifact had been so easily caught by the other party.

source: 振祥的脸色黑成了锅底，再没了刚刚那谦谦君子的样子，看向郁红的眼神满满都是杀意，声音也冷了数倍，扬手就唤出武器，“既然你们知道得如此清楚，今日便更不能放你们离开了！”
en_us: Zhen Xiang's face turned as black as the bottom of a pot. No longer did he have the look of a gentleman about him that he had just now as he looked at Yu Hong with all the intention to kill. His voice had turned much colder as he raised his hand to summon forth his weapon and said, "Since all of you already know about this so clearly, there is no way I am letting you off today!"

source: 据大长老说，是他娘亲在他一岁时购买的弃婴，给他做侍女的。尽管名分上是侍女，但江逸和江小奴一同长大，情同兄妹，在大长老失踪后两人更是相依为命。这些年来如果不是江小奴一直为他鼓气加油，他也不知道能不能坚持下来！
en_us: According to the Grand Elder, his mother bought Xiaonu as a maid to serve him when he was one years old. Although her status was just a maid in the household, Xiaonu was never treated like one—she grew up together with Jiang Yi like a sibling. After the disappearance of the Grand Elder, each depended on the other for survival. If not for Xiaonu's constant encouragement, it would have been hard for Jiang Yi to endure the difficult times.

source: 掀桌！
en_us: Flips table!

source: 掀桌！为什么他以前不知道，系统会有记录功能？为什么几百年前的记录还在！人家说你是育儿，你还真变育儿用的啊喂！
en_us: He wanted to flip the table! Why didn't he find out earlier that the system kept all these things on record? Why were records from a hundred years ago still in there? She called you a parenting system and you really have to act like one?

source: 掀桌！你到底拿了多少人家的东西啊喂！
en_us: I'm about to flip! How many items have you taken from this person!

source: 掀桌，原来只是砸啊喂，尼玛这叫逼出来啊，这明明就是拆迁好吗？！别以为你用的不是挖掘机我就认不出来啊，魂淡！
en_us: I'm gonna flip out! This is just plain smashing. You call this forcing it out?This is obviously a demolition operation! Don't think that I can't recognize an excavator when I see one, asshole!

source: 掀桌，谁TM要跟你一起吃啊，把我的剑仙还给我！
en_us: Who wants to freaking eat with you, give me back my sword immortal!

source: 掀桌，这TM不是一本书的世界吗？为啥别人的穿越方式，完全不一样啊。为啥所有理所当然的事，一到沈萤身上就走神展开啊，你TM到底是个外挂还是个BUG啊啊啊啊！
en_us: Wasn't this the world of a single book? Why would other people have different ways of transmigrating? Why did the things that were taken for granted change the moment it concerned Shen Ying? Are you a freaking cheat or bug!

source: 掌事让他们在一个小间隔里等着。羿清也开始主动解释起这份短时工的性质，这里是个商行，一般只有在商家获得难得一见的法宝法器或是丹药时，会举行拍卖。每当这个时候，店家会临时聘请一些修士，护送拍到物品的人回去，也算是售后服务。只不过这些护卫一般都是筑基修士，而且皆是散修。
en_us: The steward got them to wait in a small partitioned space. Yi Qing took the initiative to explain the nature of this temporary job. This was a commercial firm, and it was usually only when they received an extremely rare Dharma treasure or artifact or elixirs that they would hold an auction sale. At times like this, the shop owner would hire some cultivators just for a short period — to escort the bidders home, which was also considered as an after-sales service. It was just that these guards were usually Foundation Establishment cultivators and they were all itinerant cultivators.

source: 接下来是第三道，第四道……
en_us: Then came the third strike, the fourth...

source: 接下来的日子，他们在秘境继续停留了一个多月。利用这段时间，孤月全力练化那道异火。异火十分强横，收服异火他花废了一番心思，可能是因为附近有着仙气的原因，成功后，连经年没有动过的修为都隐隐有松动的痕迹。
en_us: The three of them remained in the mystic realm for over a month. In this time, Lonemoon wholeheartedly cleansed the Deviant Fire. The Deviant Fire was extremely strong — he took a lot of effort just to contain it. This was probably because there was a lot of Immortal Qi surrounding them. After he had contained the Deviant Fire, his cultivation level — which had remained the same throughout the year — finally began to increase.

source: 接下来薄飞平果然忙得晕头转向起来，先是关闭了仙城，只出不进。并及时通知了前去上报情况的薄仪。门已经找到了，接下来怎么处理，就不是他们可以插上手的事了。孤月也没有多停留，找着门就回去了无敌派。
en_us: Following on, Pu Feiping was as busy as a bee with so much work to do. First, he had to close the immortal city, only allowing people to leave but not enter. At the same time, he also had to inform Pu Yi who was already on his way to report the matter to the upper courts. The door had been found, thus the follow up work was no longer something they could interfere with. Lonemoon did not stay any longer as well, and returned to the Invincible Sect.

source: 接待他的还是上次的刘管事，刘管事客气的将江逸带进雅阁内，招来侍女奉上香茗后，才微笑问道：“公子，您这次是又准备出售丹药吗？难道有好货色？”
en_us: The person who greeted him was Housekeeper Liu, who he had met before. Housekeeper Liu courteously brought Jiang Yi into an elegant booth. After instructing his maidservant to serve some aromatic tea, he gave a small smile. "Young Master, are you ready to sell more elixirs during this visit? Do you perhaps have some high-quality products?"

source: 接着那管事就出现了，狠狠扇了江小奴一巴掌，让护卫把小奴带到了后院，让她要么赔钱，要么签卖身契……
en_us: Following that, that housekeeper appeared and viciously gave Jiang Xiaonu a slap and allowed the guard to bring Xiaonu to the backyard, demanding that she pay up for the damages or otherwise sign a contract and sell herself to the household...

source: 推断出自己的身世，江逸不仅没有半点喜悦，反而脑中都是愤慨之气。对于这个突然冒出来的父亲，他没有半点认同感，亦如他娘亲说的，他没有父亲！以前没有，现在没有，以后也没有……
en_us: Even after deducing his background, Jiang Yi did not even feel slight happiness, but instead, his entire mind was filled with rage and indignance. He did not feel any sense of acknowledgement towards this father that came out of no where. Like what his mother had said, he did not have a father! He did not have, does not have, and would never have one in the future...

source: 提着水壶，正准备去给萝卜浇水的某人：“……”
en_us: The person carrying a pail of water, prepared to water Radish: "..."

source: 摇了摇头，江逸强迫自己不去多想，开始数起数来。荣管事只给了他两个时辰，要是不能及时清点完毕，回去挨骂事小，要被扣掉月例那就太严重了。
en_us: Shaking his head, Jiang Yi forced himself not to overthink and to instead start counting the plants. Chief Rong had only given him four hours to finish this task, after all. If he was unable to finish this work in time, he have to endure yet another scolding and something worse: a salary cut. If his monthly salary was cut, he would be thrown into a truly terrible situation.

source: 摇晃了一下脑袋，江逸重新盘坐起来，暗暗沉吟起来：“嗯……先修炼江水决，这段时间小心些，别被江如虎等人截了。等攒够足够的银钱，我再出去外面购买高级丹药，加快修炼！哼哼，只要我有铸鼎境二重配合黑色元力，江如虎你们敢来找麻烦，看我不把你们一个个打成血猪头？”
en_us: Shaking his head, he returned to his cross-legged sitting posture, quietly muttering, "Hmph... I should first practice the Jiang Water Art. I should be more careful during this period of time and not get caught by Jiang Ruhu and gang. "Once I have acquired enough money, I can head out to purchase high-quality elixirs and speed up my training in refinement! Heh heh! Once I reach the second level of the Cast Tripod Realm and combine that power with black essence force, should Jiang Ruhu dare to come to find trouble... see if I tear you guys up to shreds?"

source: 擒贼先擒王！
en_us: To catch bandits, one must first capture the bandit leader!

source: 收啥徒弟啊！她连小学都留级了两次。
en_us: What! Taking in a disciple!? Even in primary school she was retained twice.

source: 敢情你不光吃，还想打包吗？！
en_us: You're not just going to eat the beast - you want to keep the flesh for later?

source: 敢情刚刚她压根就没醒啊喂！
en_us: It seemed that she had been asleep all the time!

source: 敢情只有他一个人以为，她们是想成为剑修的？！
en_us: Was he the only one who thought that they wanted to become Sword Cultivators?!

source: 敢情只有他是无敌派捡来的是吧？
en_us: So what now, he is the only on picked back from the roadside by Invincible Sect?

source: 敢情这妖怪大晚上做慈善去了？那死的那十几个人是怎么回事？这妖怪是想把人养胖了再杀吗？
en_us: Don't tell me that this demon is doing charitable work during the night? Then how to explain the dozen or so people who died? Is this monster trying to fatten people up before killing them?

source: 敢来风月楼闹事，他可不管这少年是谁先打了再说，铸鼎境一重在铸鼎境二重的他看来……屁都不是。
en_us: Since the youth dared to barge into Fengyue Brothel to stir trouble, he did not care who he was. A beating was in order. To him, the first or second stage of the Cast Tripod Realm was… nothing to him.

source: 数不清的骸骨巨人、尸人、尸兽和阴兵铺满虚空，密密麻麻，遮天蔽月，它们身上或身周隐隐发亮的暗灰色符文流转不停，光影迷离，规模宏大，似乎把那座原本宏伟神圣，在今夜却显得漆黑寂静的天庭巨城也给比了下去。
en_us: Countless skeleton giants, zombies, zombie-beasts, and yin soldiers crowded the space, blotting out the sky and moon. Grey runic patterns sparkled continuously from their bodies—light and shadows blurred. The spectacle was so grand and divine that even the Heavenly Court city, dark and silent that night, paled in comparison.

source: 整个三青界从来没有出现过真正的仙人，碧涛只是仙人的一缕残魂，都能在这仙宫中存在几万年，还保持他们都无法探寻到的实力，谁都不知道真正的仙人到底厉害到什么地步。虽然他们有沈萤这个外挂，但在仙人面前，也不一定有什么胜算。
en_us: The Three Realms had never produced a true immortal before. Bitao was only the remnant soul of an immortal, yet he could stay in this Immortal Pavilion for 50,000 years and hide it so that nobody could easily find the Pavilion. Nobody knew what a true immortal would be capable of. Although they had Shen Ying the Cheat with them, they still wouldn't have a chance of winning against an immortal.

source: 整个三青界，几乎没有体修，就算有也在第一次结丹时，被劫雷劈死了。人类的身体，可比不上妖兽之类那般强悍。可思羽妹子，却硬生生抗了下来。即使八十一道劫雷劈完后，她已经只剩下个血架子，却仍是咬着牙完成了结丹。
en_us: There were barely any Body Cultivators in all of the Three Realms and even for the ones that existed, they would die from the bolts of lightning during their first Core Formation. A human body was not as tough as the demons’. However, Sister Si Yu forcibly held on. Even after the 81 strikes of lightning had ended and she was only left with a bloody frame, she gritted her teeth to complete her Core Formation.

source: 整个上青界都在坐等好戏！等着轩辕家的游仙长老归来后，如何向这两人讨回来。却不知为何，三个月过去，轩辕家一点动静都没有。而且自那天后，整个家族一反常态，行事作风居然开始低调起来。就连外出送丹弟子，都被要求不能惹出任何事端。
en_us: All of the Upper Azure World was waiting to watch a good show. They were waiting for the Elders from the Xuan Yuan Family to return. They were curious to see how they would take revenge on the two sword cultivators. It came as a surprise, therefore, when the Xuan Yuan Family remained quiet for the next three months. From the day the Elders returned, the entire Xuan Yuan Family seemed to have gone under the radar. Even the disciple who was sent out to deliver pills and elixirs had been ordered not to stir any trouble or attract any attention to himself.

source: 整个世界再次变得清晰，时间的流动似乎也凝滞了起来……
en_us: The whole world turned distinct again, and time also seemed to pass sluggishly.

source: 整个丹炉一颤，江逸被一股反震之力推到在地，他眼中都是喜色，昨日不就是炸丹才练出两枚地阶丹药吗？
en_us: The entire cauldron trembled as Jiang Yi was pushed to the ground by the force of a large reverberating shockwave. His eyes were filled with glee. Was it not the case the day before that the two Earth-tier elixirs were refined only after the original pills exploded?

source: 整个丹炉又一次剧烈摇晃，等他打开一看整张脸都黑了，里面的三枚丹药加上原先的两枚全炸了，变成了残渣，一枚不剩……
en_us: Once again the entire cauldron trembled violently. When he lifted the lid and took a look, he facial expressions turned to one of angry dismay. The three elixir pills inside, in addition to the two original pills, had exploded completely and turned to smithereens, with not a single pill left...

source: 整个客栈早早的清了场，寂静无声。客栈的内院正中，一个鸡笼里关着四五只肥壮的公鸡，时不时的发出几声翅膀的拍打声。
en_us: The entire inn, having been cleared of all customers very early on, was filled with silence. In the middle of the inn’s inner courtyard, there were four or five fat cockerels in a cage, and the flapping of their wings could be heard from time to time.

source: 整整一个上午，江逸都在柳长老的指挥下忙进忙出，还被骂了整整一个早上。这柳长老明显一夜未睡觉，但炼丹起来却如走火入魔般，眼看到了午后时分了，江逸都饿得肚子哇哇叫还没有停下的意思。
en_us: For an entire morning, Jiang Yi had been hustling and bustling under Elder Liu's orders and was scolded the entire time in the process. It was clear that Elder Liu had not slept an entire night, but when it came to refining elixirs it was as if he had been possessed by the devil. Jiang Yi saw that it was already noon and his stomach was rumbling loudly with hunger, yet Elder Liu did not seem to have any intention to stop.

source: 整整一天，他都没有出门，在家疗伤同时研究黑色元力，结果让他有些郁闷。尽管黑色元力再次出现两种新的能力——能让听力和嗅觉增强，但研究了一天，无论他怎么想办法，这黑色元力提炼的上限只有十缕！
en_us: He did not leave his room for the entire day. While he was at home, he tended to his injuries and studied the black essence force. The result, however, left him somewhat depressed. Two new abilities of the black essence force were revealed: his hearing and sense of smell could both be made sharper. Despite this, after researching for a single day, no matter what ideas he could come up with, the upper limit of the black essence force he could refine was only ten strands!

source: 整整半柱香时间，撕裂般的痛楚才缓缓消失。江逸全身冷汗淋漓，汗毛倒立，好半天才艰难的坐了起来。
en_us: It took half the time needed for an incense stick to burn out completely before the skin-splitting pain finally dissipated. Jiang Yi’s body was covered in cold sweat, and goosebumps rose to full attention on his arms and back. It took a very long time before he finally managed to lift himself into a seated position.

source: 断空涯地势险要易守难攻，又位处于幻海边缘，常年阴气不散，魔窟外更是布下了专门针对仙修的聚阴大阵。四大世家与众修仙门派屡次想解决这窝魔头，却被四周的阴气所阻，根本攻不上断空涯就得退出来。久而久之，那里成了众多魔修的容身之处，名副其实的魔窟。
en_us: Sky Severance Cliff was extremely easy to defend and it was at the border of the Mirage Sea. The Yin Qi had always been strong there, never dissipating. There was an great array formation of Yin just outside the Fiend Den which was set up specially to get rid of Immortal Cultivators. The four great aristocratic families and the immortal cultivation sects had tried countless times to destroy the Fiend Den but the Yin Qi had stopped them from doing so—they were always forced to retreat even before they made it to the top of Sky Severance Cliff. As time went by, the Fiendish Cultivators made their homes on the cliff. That was how the Fiend Den had formed.

source: 旁边偏厅内，立即传来一道暴怒的大吼：“混账东西！这炉丹药可是人阶上品的灵神丹，老夫撕了你……”
en_us: From the side room immediately came a furious roar: "Damn it! This cauldron contained Man-tier superior-grade Spirit Pills! I’m going to kill you, Jiang Yi!"

source: 旁边的孤月第一时间察觉，也同一时间放出了威压，瞬间把对方的气势给顶了回去。上青界又怎么样？他们玄天宗也不是好欺负的。
en_us: Lonemoon at the side was the first to notice this, and also released suppression, which immediately pushed back the other party's imposing stance. So what if they were from the Upper Azure World? The Blackheaven Sect was not to be trifled with.

source: 旁边的羿清，淡定的夹起另一块放在了她碗里。
en_us: Yi Qing at the side and picked up another piece of meat into her bowl calmly.

source: 无人说得清到底是谁攻下了这个魔窟，只是断空涯的石壁之上，留下了“无敌”二字。一时间众说纷芸。有人说是四大世家终于忍受不了断空涯的挑衅，所以联合了诸多游仙，一起强行攻下了魔窟。有人说是魔头得罪了妖界大妖，妖怪不惧阴气，所以能解决他们。更有人说可能是哪位隐世的高人做的。至于那无敌二字，只是为了警告魔修不要太过嚣张。
en_us: No one knew exactly who had taken down the Fiend Den. All that was known related to this incident was a single word which was left on the stone wall atop Sky Severance Cliff—"Invincible". This was the talk of the town. Some said that the four aristocratic families had finally had enough of the constant provoking from Sky Severance Cliff and so had gathered a whole group of their best Traveling Immortals to take down the Fiend Den by force. Others said that the fiends had offended the Great Demons from the Demon Realm. Since demons were unaffected by Yin Qi, they would be able to get rid of the fiends. Yet others said that some hidden expert had done the deed and the word "invincible" was meant as a warning to the Fiendish Cultivators so they would not get too cocky.

source: 无名轻叹一声，道：“如果真要打，老不死你至少要耗掉整个冥界的五成兵力，才能攻破这座天庭的三重防护大阵，那得熬到什么时候？十天还是半个月？更关键的是就算你最终攻破了这里，也最终成功送走了我，可接下来为恢复你的实力以及兵力，你还要在各界制造多少血腥杀戮？我烦恼的其实是这个啊……”
en_us: Wu Ming sighed. "If you want to fight, Old Fart Undying, you will need to expend half of all the Netherworld's military might before you can take down the three-layered protective array of the Heavenly Court. “How long can you withstand the array? Ten days? Half a month? Even if you finally succeed in overrunning the area, you will only succeed in getting rid of me. After that, how much blood do you need to shed in order to recover your strength and military might. I am actually vexed over that…"

source: 无妨才怪吧，都吐血了喂，卧槽还在吐啊！
en_us: How could he be alright, especially since he had vomited blood. Holy shit he was still vomiting!

source: 无敌派。
en_us: At Invincible Sect.

source: 无敌派少了个管家，沈萤算是彻底的放飞自我了。强烈要求从一顿六个菜，增加到八个。刚决定跟厨子商量一下，夜宵、下午茶的上岗再就业问题。
en_us: Now that the Invincible Sect was without a housekeeper, Shen Ying was completely free to do as she pleased. She demanded that the number of dishes per meal be increased from six to eight an was deciding to discuss with the chef on the issue of hiring staff for the preparation of supper and afternoon tea.

source: 无敌派的人，都这么……高深的吗？
en_us: Are Invincible Sect's members all so... deep?

source: 无敌派的位置，他虽然告诉过生意伙伴印家，但由于地处妖界，所以交易的地点约定是在上青城。印家也不可能会透露他们的位置，再加上妖界遍地都是妖类，想要平安来到无敌派山下十分困难。他只有元婴修为，只有可能是靠着系统来到这里的。
en_us: He did tell his business partners, the Yin Family, about where Invincible Sect was located. However, because they were located in the Demon Realm, he told them that they would meet at the Upper Azure Town instead. What's more, the Yin Family would not have told others about the Invincible Sect's location. Given the number of demons that lurked around in the Demon Realm, it would be difficult for anyone to arrive at the Invincible Sect's hill safely. He was only a Nascent Soul - there was no way he would have made it if not for the system.

source: 无敌派的掌门是大仙啊！
en_us: The Sect Master of the Invincible Sect was a Great Immortal!

source: 无敌派除了他和羿清，全是体修，体修重在淬体，法器灵宝对体修来说根本没有任何用处，唯一用得上的也就是少量的灵植丹药了，但那也是快被揍死的时候应急用的。而整个无敌派，最多的就是灵植。
en_us: Besides him and Yi Qing, the rest of them in the Invincible Sect were body cultivators. Body cultivation focuses on pure energy, Dharma artifact and spirit treasures are not of any use to body cultivators, the only one that could be used would be a small dose of spirit herbs and elixirs, but those were also only useful for emergencies when they were almost beaten to death and the thing that the whole Invincible Sect had the most was spirit herbs.

source: 无敌派，名字倒挺霸气，但却是从未有人听闻过，一看就是新生的小门派。虽然三人中，有两人看似修为不浅，一身气势隐隐有压过在场所有人的趋势，却也没有人轻易敢加入。
en_us: Invincible Sect sounded formidable and powerful, but nobody had ever heard of it. Everybody could tell that the sect was newly formed and small. Even though two out of three of the people from the sect seemed to be of a considerable cultivation level and looked like they could possibly beat everyone else around them, nobody dared to join their sect.

source: 无敌派，后殿。
en_us: In the rear hall of Invincble Sect.

source: 无视冥皇的威胁，无名依旧坐在那里喋喋不休，只是……从他的身体内部，不知何时冒出了一股股熊熊烈火。
en_us: Ignoring the Netherworld King's menacing stare, Wu Ming continued to sit there blabbering away. However… it was unknown when wisps of raging flames emerged out of his body.

source: 无视又惨叫起来的江如虎，江逸目光锁定围过来的众人，他嘴角此刻还有淤血，配合他那冷漠的神情，看起来别有一番摄人之威。
en_us: Disregarding Jiang Ruhu, who had started screaming in agony once again, Jiang Yi's gaze was locked onto the corwd of opponents surrounding him. There was still some clotted blood on the corner of his mouth at that moment. Coupled with his stone-cold facial expression, he looked as though he had some sort of special power to enchant others.

source: 无视议论纷纷的众人，他沉声开口道，“我见过的草木灵生长于那个上古秘境，并不是你们轩辕之物。”
en_us: Without any regard for the crowd that was furiously whispering behind him, he said, "I've seen the Vegetation Spirit grow in the ancient mystic realm, and it does not belong to your Xuan Yuan Family."

source: 既然已经砸破江如龙的脑袋，江逸也无所顾忌了，索性继续抡着江如龙在演武殿内狂舞，不过这次他控制了一些力道，不敢将他活活砸死，否则他也怕只有死路一条了。
en_us: Since he already smashed up the head of Jiang Rulong, Jiang Yi didn't have any scruple any longer. He simply continued to whirl Jiang Rulong around in the Martial Arts Demonstration Hall like he was performing a mad dance. But this time, he controlled his strength as he didn't dare to smash Jiang Rulong to his death. If he did, he would be immediately put to death.

source: 既然有人点将，江逸只能苦笑出战了，跟随翊凌雪走了一个练功房内，很快房门就关闭了，房间墙壁上光芒闪耀，两人的元力都被封印。
en_us: Since there was someone deliberately ordered him, Jiang Yi could only smile bitterly and head out for combat. Following Yi Lingxue, he walked into one of the technique practising rooms. It was not long before the door to the room sealed shut and the walls of the room shone brightly as both persons' essence forces were sealed off from use.

source: 既然猜出了江如虎的如意算盘，江逸怎么能让他得逞？这几日他虽然一直在修炼，但大部分时间都在提炼黑色元力消融封印上的符文，并没有过多的去修炼江水决，实力还停在铸鼎境一重，此刻和江如虎对上，那肯定只有挨揍的份。
en_us: Since Jiang Yi guessed Jiang Ruhu's wishful thinking, how could he allow him to prevail? The past few days, while he had always been practicing refining, he had spent most of his time refining black essence force to remove the runic characters on his seal and had barely practiced the Jiang Water Art. With his strength still stuck at the first stage of the Cast Tripod Realm, should he fight with Jiang Ruhu at that present moment, he would suffer a beating.

source: 日上三竿，柳长老却没有出现，江逸也不管了，一个人又兴奋的开始提炼黑色元力，破解封印上的符文。
en_us: It was already late in the morning, yet Elder Liu had not shown up. Jiang Yi chose not to care; instead, he decided to start refining black essence force on his own to continue breaking the runic patterns on his seal.

source: 早就想揍这个跟他抢师父的小婊砸了！
en_us: He always wanted to beat this little guy for stealing his master!

source: 早猜到第三层不简单，没想到是他们五个，而且还恢复了仙骨。羿清拼命握紧了手中的剑，如今的情况，也只有一战！
en_us: He knew that the third level would not be simple, but he had not expected the five traveling immortals to have restored their immortal bones. Yi Qing held onto his sword for dear life. Given his circumstances, he had no choice but to fight!

source: 早知道应该带着萝卜一起出来的，可现在已经走了大半天了，要不先回去？
en_us: If she had known she would get lost, she would have brought Radish out with her. She has already walked such a distance... should she turn back?
